In [105]:
import pandas as pd

In [106]:
# The path to our CSV file
data_to_read = 'KickstarterData.csv'
# Read our Kickstarter data into pandas
ks_data_df = pd.read_csv(data_to_read)

In [107]:
# Get a list of all of our columns for easy reference
ks_columns = ks_data_df.columns

In [108]:
# Extract "name", "goal", "pledged", "state", "country", "staff_pick",
# "backers_count", and "spotlight"
ks_extract_df = ks_data_df[["name", "goal", "pledged", "state", "country", "staff_pick","backers_count", "spotlight"]]

In [109]:
# Remove projects that made no money at all
ks_extract_df = ks_extract_df[ks_extract_df.pledged != 0]
ks_extract_df

,name,goal,pledged,state,country,staff_pick,backers_count,spotlight
0,The Class Act Players Theatre Company Presents...,"$1,500.00","$2,925.00",successful,US,False,17,True
1,MR INCREDIBLE by Camilla Whitehill - VAULT Fes...,"$2,500.00","$2,936.00",successful,GB,True,15,True
2,RUN,"$1,000.00","$1,200.00",successful,GB,False,30,True
3,9th International Meeting of Youth Theatre sap...,"$2,000.00","$2,135.00",successful,IT,False,24,True
4,Get Conti to the Ed Fringe!,"$1,000.00","$1,250.00",successful,GB,False,28,True
...,...,...,...,...,...,...,...,...
4115,Bring Love's Labour's Lost to Minnesota,"$25,000.00","$25,388.00",successful,US,True,213,True
4116,Score,$300.00,$340.00,successful,GB,False,17,True
4117,"""The Santaland Diaries"" by David Sedaris in Lo...","$6,000.00","$7,140.00",successful,US,False,108,True
4118,REBATEnsemble Presents: ICONS - The Martin Show,$300.00,$312.00,successful,US,False,6,True
4119,Licensed To Ill,"$3,000.00","$3,084.00",successful,GB,False,78,True

In [110]:
# Collect only those projects that were hosted in the US
ks_extract_df = ks_extract_df[ks_extract_df.country == "US"]
# Create a list of the columns
ks_columns_2 = ks_extract_df.columns
# Create a new df for "US" with the columns above.

In [111]:
# Create a new column that finds the average amount pledged to a project
ks_extract_df["Average Pledged"] = ks_extract_df.pledged/ks_extract_df.backers_count
ks_extract_df

,name,goal,pledged,state,country,staff_pick,backers_count,spotlight,Average Pledged
0,The Class Act Players Theatre Company Presents...,"$1,500.00","$2,925.00",successful,US,False,17,True,$172.06
8,Forefront Festival 2015,"$7,200.00","$7,230.00",successful,US,False,68,True,$106.32
11,Hamlet the Hip-Hopera,"$9,747.00","$10,103.00",successful,US,True,132,True,$76.54
14,Pride Con,"$15,000.00","$15,110.00",successful,US,False,60,True,$251.83
15,En Garde Arts Emerging Artists Festival BOSSS,"$10,000.00","$10,306.00",successful,US,True,80,True,$128.82
...,...,...,...,...,...,...,...,...,...
4109,Going To Market,"$2,000.00","$2,100.00",successful,US,False,41,True,$51.22
4110,LIBERTY! EQUALITY! AND FIREWORKS!... A Civil R...,"$3,000.00","$3,506.00",successful,US,False,35,True,$100.17
4115,Bring Love's Labour's Lost to Minnesota,"$25,000.00","$25,388.00",successful,US,True,213,True,$119.19
4117,"""The Santaland Diaries"" by David Sedaris in Lo...","$6,000.00","$7,140.00",successful,US,False,108,True,$66.11
4118,REBATEnsemble Presents: ICONS - The Martin Show,$300.00,$312.00,successful,US,False,6,True,$52.00

In [112]:
# First convert "average_donation", "goal", and "pledged" columns to float
ks_extract_df["Average Pledged"] = ks_extract_df["Average Pledged"].astype(float)
# Then Format to go to two decimal places, include a dollar sign, and use comma notation
pd.options.display.float_format = '${:,.2f}'.format

In [113]:
# Calculate the total number of backers for all US projects
total_backers = ks_extract_df["backers_count"].count()
total_backers

2129

In [114]:
# Calculate the average number of backers for all US projects
avg_backers = ks_extract_df["backers_count"].mean()
avg_backers

41.931892907468296

In [115]:
# Collect only those US campaigns that have been picked as a "Staff Pick"
ks_extract_df_staff_picks = ks_extract_df[ks_extract_df["staff_pick"] == True]
ks_extract_df_staff_picks

,name,goal,pledged,state,country,staff_pick,backers_count,spotlight,Average Pledged
11,Hamlet the Hip-Hopera,"$9,747.00","$10,103.00",successful,US,True,132,True,$76.54
15,En Garde Arts Emerging Artists Festival BOSSS,"$10,000.00","$10,306.00",successful,US,True,80,True,$128.82
39,"""Poor People"" at FringeNYC 2015","$5,500.00","$5,682.00",successful,US,True,34,True,$167.12
44,Queen Mab's Steampunk and Fairie Street Festival,"$1,300.00","$3,363.00",successful,US,True,62,True,$54.24
45,RAFT: a new play by Emily Kitchens,"$7,500.00","$7,826.00",successful,US,True,120,True,$65.22
...,...,...,...,...,...,...,...,...,...
4086,Prison Boxing: A New Play by Leah Joki,"$12,200.00","$12,571.00",successful,US,True,134,True,$93.81
4095,Bluebirds by Joe Brondo,"$7,000.00","$7,365.00",successful,US,True,75,True,$98.20
4100,The Seagull Project Presents: The Three Sisters,"$20,000.00","$21,573.00",successful,US,True,202,True,$106.80
4104,Verdigris - A Play by Jim Beaver,"$35,000.00","$56,079.83",successful,US,True,930,True,$60.30
4115,Bring Love's Labour's Lost to Minnesota,"$25,000.00","$25,388.00",successful,US,True,213,True,$119.19

In [117]:
# Group by the state of the campaigns and see if staff picks matter (Seems to matter quite a bit)
state_groups = ks_extract_df.groupby("state")
state_groups.count()

,name,goal,pledged,country,staff_pick,backers_count,spotlight,Average Pledged
state,,,,,,,,
canceled,216,216,216,216,216,216,216,216
failed,1123,1123,1123,1123,1123,1123,1123,1123
live,13,13,13,13,13,13,13,13
successful,775,775,775,775,775,775,775,775
suspended,2,2,2,2,2,2,2,2

In [118]:
state_groups_staff_picks = ks_extract_df_staff_picks.groupby("state")
state_groups_staff_picks.count()

,name,goal,pledged,country,staff_pick,backers_count,spotlight,Average Pledged
state,,,,,,,,
canceled,6,6,6,6,6,6,6,6
failed,21,21,21,21,21,21,21,21
live,2,2,2,2,2,2,2,2
successful,145,145,145,145,145,145,145,145